# Subsetting
Review core mehtods to select data from a `pandas.DataFrame`

## Read in CSV

To read in a CSV into our Python workspace as `pandas.DataFrame` we use the `pandas.read.csv` function:

In [3]:
import pandas as pd

# Read in file, argument is the file path as a string
df = pd.read_csv('data/wetlands_seasonal_bird_diversity.csv')

# Print df's first five rows
df.head()

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

### About the data
Birds were surveyed in four wetlands:

    -Carpinteria Salt Marsh (CSM)
    -Mugu Lagoon (MULL)
    -San Dieguito Wetland (SDW)
    -Tijuana Estuary (TJE)
    
Values from second column to the last colum = the number of different bird species across the survey sites in each wetland during springm winter, and, fall, for a given year

year column = year on which data was collected

In [4]:
# Print dfs column names
df.columns

Index(['year', 'CSM_winter', 'CSM_spring', 'CSM_fall', 'MUL_winter',
       'MUL_spring', 'MUL_fall', 'SDW_winter', 'SDW_spring', 'SDW_fall',
       'TJE_winter', 'TJE_spring', 'TJE_fall'],
      dtype='object')

In [5]:
# List dtypes of each column
df.dtypes

year            int64
CSM_winter    float64
CSM_spring    float64
CSM_fall      float64
MUL_winter    float64
MUL_spring    float64
MUL_fall      float64
SDW_winter    float64
SDW_spring    float64
SDW_fall      float64
TJE_winter    float64
TJE_spring    float64
TJE_fall      float64
dtype: object

In [6]:
# Print df's shape output is a tople (# rows, # columns)
df.shape

(14, 13)

## Selecting a single column

Simple case: select a single column by column name

General syntax:
```python
df['column_name']
```

This is an example of **label-based subseting**, which means we want to select data from the data frame using ther names of the columns not by their position.

### Example
Select number of bird species observed at Mugu Lagoon in spring

In [10]:
# Select a single column by using square brackets []
mul_spring = df['MUL_spring']

mul_spring

# It is a pandas series

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

In [12]:
# Confirm the type of the output
print(type(mul_spring))

<class 'pandas.core.series.Series'>

Recall: we can think of a `pandas.DataFrame` as a dictionry of its columns. 
Then, we can access a single column using the column name as the *key*, just like we would 
in a dictionary

`df['column_name']`

We can also do label-based subsetting of a single column using attribute syntax:
```python
df.column_name
```
Example:

In [13]:
df.MUL_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

**Favor df['column_name'] instead of df.column_name**

Why?

- `df[column_name]` avoids conflicts with `pd.DataFrames` methods and attributes. For example if `df` has a column named `count`, its ambigious whether `pd.count` is referring to the `count()` method or the `count` column 
- df['column_name']
-`df.column_name` only works if the column name has no spaces or special characters

## Selcting multiple columns...

### ... using a list of column names

select multiple columns in a single call by passing a list of column names to square brackets `[]`

Second square brackets come from the list

```python
df[ [ 'col1,' 'col2', 'col3']]
```

Notice the "double-brackets." This is because we are passing the list of names  [ 'col1,' 'col2', 'col3'] to selection brackets

## Check-in 

Is this label based or location-based?

### Example

In [15]:
# Select column with names 'TJE_winter' and 'TJE_fall'

tje_wf

NameError: name 'tje_wf' is not defined

### ...using a slice

To select a slice of the columns we wwill use a special case of **`loc` selection**. General syntax:

```python
df.loc[ : , 'column_start':column_end']
```

`column_start` and `column_end` = the starting and ending points of the column slice we want to subset from the data frame. 

Notice

- the first value passed to `loc` is used for selecting rows, using a colon ``:` as the row-selection parameter means "select all the rows"

- the slice of the resulting data frame includes both endpoints of the slice

In [16]:
# Select columns between 'CSM_winter' and 'MUL_fall'
csm_mul = df.loc[:, "CSM_winter':'Mul_fall']
csm_mul.head()

SyntaxError: EOL while scanning string literal (1901947877.py, line 2)

## Selecting rows ...
### ...using a condition

To select rows that satisfy a particular condition the general syntax is 

```python
df[condition_on_rows]
```

The `condition_on_rows` can be many things, lets see some usual scenarios

### Example

We are interested in data after 2020 
"select all the roads after 2020"

In [18]:
# Select all rows with year > 2020
post_2020 = df[df['year']>2020]
post_2020

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

condition for our rows = `df['year']>2020`
this is a `pandas.Series` with booooolean values (`True` or `False`) indicating which rows satisfy the condition
year>2020

In [20]:
# Check the type of df['year']>2020
print(type(df['year']>2020))

# Pring boolean series 
df['year']>2020

<class 'pandas.core.series.Series'>

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
13     True
Name: year, dtype: bool

Series is acting as a mask for the data frame

When we pass such a series of boolean values to the selection brackets `[]` we keep only the 
that correspond to a `True` value

## Check in 
Get the subset of the frame on which the sand dieguito wetlands jas at least 75 species during spring

In [24]:
sdw_spring = df['SDW_spring']
df_subset =df['SDW_spring']>= 75

df_subset

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
Name: SDW_spring, dtype: bool

In [27]:
sdw_spring1 = df[df['SDW_spring']>=75]

In [28]:
df['SDW_spring']>=75

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
Name: SDW_spring, dtype: bool

#### Example
We want to look at data from years 2012 to 2015 including both years
We can use this `between` method in our conditions:

In [4]:
subset = df[ df['year'].between(2012,20150)]

Let's break it down:

1. df[`year`] = column with the year values, a `panda.Series`
2. in `df['year'].beatween()` we are acessing a method for the `panda.Series` ueasing ","
3. (2012,2015) = parameters tjos omcludes both endpoints
4. sdw_spring1 = df[df['SDW_spring']>=75] '=' `panda.series` of boolean values indicating which rows have year value between 2012 and 2015
5. When we put df[ df['year'].between(2012,20150)] inside the selection brackets '[]' we obtain rows we wanted to select

#### Avoid using loc for selecting only rows
its the same to write

In [5]:
# select rows with year <2015
df[df['year']<2015]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

In [6]:
# Select rows with year <2015 usign loc 
df.loc[df['year']<2015, :]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

We prefer the first syntax bc it is simpler

### Select columns using multiple conditions

We can combine multiple conditions to select rows by surrounding each one in () and using the or operator | and the and operator &

## Example: or 
Select rows in wich the csm has more than 50 species registered in winter *or* march 
Square brackets are always selection brackets

In [21]:
df[(df['CSM_winter']>50) |(df['CSM_fall']>5)]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0
5,2015,44.0,42.0,45.0,58.0,50.0,51.0,71.0,61.0,65.0,73.0,76.0,64.0
6,2016,41.0,36.0,47.0,63.0,48.0,58.0,67.0,62.0,57.0,76.0,76.0,58.0
7,2017,46.0,41.0,43.0,57.0,54.0,53.0,66.0,45.0,54.0,72.0,63.0,57.0
8,2018,48.0,48.0,44.0,56.0,54.0,57.0,55.0,49.0,51.0,66.0,60.0,55.0
9,2019,39.0,39.0,40.0,57.0,52.0,53.0,54.0,55.0,53.0,63.0,54.0,50.0
10,2020,46.0,NaN,47.0,56.0,NaN,66.0,57.0,NaN,58.0,54.0,40.0,54.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

## Example: and
Select rows in boths the CSM and the SDW have morw than 60 species during spring

In [22]:
df[(df['CSM_winter']>50) & (df['CSM_fall']>5)]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

An empty data frame thats okay no rows satisfy the conditions

## Select rows by positions
soemtimes we may want to select certain rows based on there actual position in the data frame. In other words using **position based** 

To do this there is a different position from loc, we use **iloc selection** santax

```python 
df.iloc[row-indices]
```

`iloc` = stands for interger-location based indexing

## Select the fifit row (index=4)

In [15]:
df.iloc[4]

year          2014.0
CSM_winter      38.0
CSM_spring      43.0
CSM_fall        45.0
MUL_winter      49.0
MUL_spring      52.0
MUL_fall        57.0
SDW_winter      61.0
SDW_spring      78.0
SDW_fall        71.0
TJE_winter      60.0
TJE_spring      81.0
TJE_fall        62.0
Name: 4, dtype: float64

In [16]:
# Select rows 9 through 13
df.iloc[9:14]

# Remember, in python it will go one less than the one you put

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
9,2019,39.0,39.0,40.0,57.0,52.0,53.0,54.0,55.0,53.0,63.0,54.0,50.0
10,2020,46.0,NaN,47.0,56.0,NaN,66.0,57.0,NaN,58.0,54.0,40.0,54.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

### Selecting rows and columsn at the same time

Can be done using `loc` (labels) or using `iloc` (positions).

### ...By labels or conditions

When we want to select rows and columns simultaneously by labels (including using conditions) we can use the `loc` selection with the syntax:

```python
df.loc[ row-selection, column-selection]
```

Example:

Select winter surveys from MUL and tje after 2020

In [ ]:
df.loc[df['year'] >2020, ['MUL_winter', 'TJE_winter']]

## Selecting by position

Suppose we want to select rows 3-7 (including 7) and columns 4th and 5th

In [25]:
#Its about position so use iloc
df.iloc[3:8, [3,4]]

   CSM_fall  MUL_winter
3      38.0        60.0
4      45.0        49.0
5      45.0        58.0
6      47.0        63.0
7      43.0        57.0

## Notes about iloc and loc
### Which one does what?

Rememeber that the i in iloc stands for integer location and it uses integer indexing the way as indexing for python list

### `iloc` for columns selection? Avoid it!
We can also access columns by posisition using iloc but best not to if possible 

Example:

We want to access the 9th column of the df and we want to select a column by position.

In [28]:
# Your code should be able to be read as if you were reading a normal text
df.iloc[8]

year          2018.0
CSM_winter      48.0
CSM_spring      48.0
CSM_fall        44.0
MUL_winter      56.0
MUL_spring      54.0
MUL_fall        57.0
SDW_winter      55.0
SDW_spring      49.0
SDW_fall        51.0
TJE_winter      66.0
TJE_spring      60.0
TJE_fall        55.0
Name: 8, dtype: float64

Unless you are *really* looking for infor about the 9th columns **do not access a column by position** this can break in many ways:

1. it relies on you correctly counting th eposiiton of a columns. Eveen with a small data set this can be a problem

2. It is not explicit: if we want infor about that colymn then we use `df['SDW_spring']` data might be updated too